In [5]:
import pandas as pd
data_frame = pd.read_csv('data/friend_list.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [8]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [9]:
type(data_frame.name)

pandas.core.series.Series

In [10]:
type(data_frame.age)

pandas.core.series.Series

In [12]:
list_tmp = [1,2,3]
list_tmp

[1, 2, 3]

In [13]:
s1 = pd.core.series.Series( [1,2,3] )
s2 = pd.core.series.Series( ['one','tow','three'] )
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    tow
2    3  three